#+TITLE: Alex's Emacs Configuration
#+AUTHOR: Alexander J. Comerford
#+OPTIONS: toc:nil num:nil
#+ROAM_TAGS:

#       _.--._  _.--._
# ,-=.-":;:;:;\':;:;:;"-._
# \\\:;:;:;:;:;\:;:a:;:;:;\
#  \\\:;:;:;m;:;\:;:;:c:;:;\
#   \\\:;e;:;:;:;\:;:;:;:s:;\
#    \\\:;:;:;:;:;\:;::;:;:;:\
#     \\\;:;::;:;:;\:;:;:;::;:\
#      \\\;;:;:_:--:\:_:--:_;:;\
#       \\\_.-"      :      "-._\
#        \`_..--""--.;.--""--.._.\
#



This goal of this file `mainconfig.org` is to centralize
most of my development environment configuration to a single
easily searchable, modifyable, and portable format/place
so no matter what system I end up moving too I can have
a full (or atleast partial) development environment that can
provide me some nice garuntees

** Who am I? Where am I?
   :PROPERTIES:
   :ID:       d236b796-5697-44a4-9937-fc8cca45484c
   :END:

   #+BEGIN_SRC emacs-lisp
     (setq user-full-name "Alexander J. Comerford"
           user-mail-address "alex@taoa.io"
           user-alternate-mail-address "alexanderjcomerford@gmail.com"
           calendar-latitude 40.6501
           calendar-longitude -73.94958
           calendar-location-name "New York, NY")
   #+END_SRC

   #+RESULTS:
	 : New York, NY


   Evil mode is frustrating at first but allows the
   emacs programmer to be much more fluid in development
   taking the best of these two disparate worlds.

   Use =evil=.

   #+BEGIN_SRC emacs-lisp
     (use-package evil
       :config
       (evil-mode 1)
       (setq evil-default-state 'emacs))
   #+END_SRC

   #+RESULTS:
	 : t

   #+BEGIN_SRC emacs-lisp
     (setq evil-want-abbrev-expand-on-insert-exit nil)
     (setq evil-toggle-key "C-q C-z")
   #+END_SRC

   #+RESULTS:
	 : C-q C-z

   Enable =surround= everywhere.

   #+BEGIN_SRC emacs-lisp
     (use-package evil-surround
       :config
       (global-evil-surround-mode 1))
   #+END_SRC

   #+RESULTS:
	 : t

   Use =evil= with Org agendas.

   #+BEGIN_SRC emacs-lisp
     (use-package evil-org
       :after org
       :config
       (add-hook 'org-mode-hook 'evil-org-mode)
       (add-hook 'evil-org-mode-hook
                 (lambda () (evil-org-set-key-theme)))
       ;; (require 'evil-org-agenda)
       ;; (evil-org-agenda-set-keys)
       )
   #+END_SRC

   #+RESULTS:
	 : t

* Programming environments
  :PROPERTIES:
  :ID:       698fe738-b95c-4312-8913-f252e017bc53
  :END:

  I like shallow indentation, but tabs are displayed as 8 characters by default.
  This reduces that.

  #+BEGIN_SRC emacs-lisp
    (setq-default tab-width 2)
  #+END_SRC

	#+RESULTS:
	: 2

  Auto closing parenthesis and brackets is really sweet and extra mental offloading

  Treating terms in CamelCase symbols as separate words makes editing a little
  easier for me, so I like to use =subword-mode= everywhere.

  #+BEGIN_SRC emacs-lisp
    (use-package subword
      :config (global-subword-mode 1))
  #+END_SRC

	#+RESULTS:
	: t

  Compilation output goes to the =*compilation*= buffer. I rarely have that window
  selected, so the compilation output disappears past the bottom of the window.
  This automatically scrolls the compilation window so I can always see the
  output.

  #+BEGIN_SRC emacs-lisp
    (setq compilation-scroll-output t)
  #+END_SRC

** Python
   :PROPERTIES:
   :ID:       4775a4b5-dfd1-40cf-8835-581047a6e1b0
   :END:

   #+BEGIN_SRC emacs-lisp
     (use-package python-mode)
   #+END_SRC

   Add =~/.local/bin= to load path. That's where =virtualenv= is installed, and
   we'll need that for =jedi=.

   #+BEGIN_SRC emacs-lisp
     (ajc/append-to-path "~/.local/bin")
   #+END_SRC

	 #+RESULTS:
   | ~/.local/bin | ~/.cabal/bin | /home/ajc/code/go/bin | /nix/store/ww1d2wkk2hd5zca6l0ilxn98f86hx3yk-emacs-packages-deps/bin | /home/cmrfrd/bin | /usr/local/bin | /home/cmrfrd/Public/scripts | /home/cmrfrd/.local/bin | /home/cmrfrd/.dotfiles/scripts | /home/cmrfrd/.nix-profile/bin/ | /run/wrappers/bin | /home/cmrfrd/.nix-profile/bin | /etc/profiles/per-user/cmrfrd/bin | /nix/var/nix/profiles/default/bin | /run/current-system/sw/bin | /nix/store/vmmnym8nhyp3abql5sjy2lz1w8nv8f2g-emacs-26.3/libexec/emacs/26.3/x86_64-pc-linux-gnu |

   Enable =elpy=. This provides automatic indentation, auto-completion, syntax
   checking, etc.

   #+BEGIN_SRC emacs-lisp
     ;;(use-package elpy)
     ;;(elpy-enable)
   #+END_SRC

	 #+RESULTS:

   Use =flycheck= for syntax checking:

   #+BEGIN_SRC emacs-lisp
     (add-hook 'elpy-mode-hook 'flycheck-mode)
   #+END_SRC

	 #+RESULTS:
   | py-autopep8-enable-on-save | flycheck-mode |

   Format code according to PEP8 on save:

   #+BEGIN_SRC emacs-lisp
     (use-package py-autopep8)
     (require 'py-autopep8)
     (add-hook 'elpy-mode-hook 'py-autopep8-enable-on-save)
   #+END_SRC

	 #+RESULTS:
   | py-autopep8-enable-on-save | flycheck-mode |

   Configure Jedi along with the associated =company= mode:

   #+BEGIN_SRC emacs-lisp
                                             ;(use-package company-jedi)
                                             ;(add-to-list 'company-backends 'company-jedi)

                                             ;(add-hook 'python-mode-hook 'jedi:setup)
     (setq jedi:complete-on-dot t)
   #+END_SRC

   #+RESULTS:
   : t

   Add anaconda mode

   #+BEGIN_SRC emacs-lisp
     (use-package anaconda-mode
       :ensure anaconda-mode)
     (use-package company-anaconda
       :ensure company-anaconda)
   #+END_SRC

*** Typescript setup
    :PROPERTIES:
    :ID:       a262b1fa-b949-43b7-b339-feaee01ee548
    :END:

    Typescript is a super awesome language that is definately worth
    using, emacs has only one ide type minor mode for this

    #+BEGIN_SRC emacs-lisp
      (defun setup-tide-mode ()
        "Set up Tide mode."
        (interactive)
        (tide-setup)
        (tide-mode +1)

        (setq flycheck-eslint-args '("--ext" ".js"  "--ext" ".jsx" "--ext" ".ts"  "--ext" ".tsx"))
        (flycheck-mode +1)
                                              ; (flycheck-select-checker 'javascript-eslint)

        (setq flycheck-check-syntax-automatically '(mode-enabled save))
        (eldoc-mode +1)
        (tide-hl-identifier-mode +1)
        (company-mode +1)
        (prettier-js-mode +1)
        ;; (lsp)
        )

      (use-package tide
        :ensure t
        :after (typescript-mode company flycheck)
        :hook ((typescript-mode . tide-setup)
               (typescript-mode . tide-hl-identifier-mode))
        :config
        (setq company-tooltip-align-annotations t)
                                              ; (add-hook 'before-save-hook 'tide-format-before-save)
        (add-hook 'js-mode-hook #'setup-tide-mode)
        (add-hook 'typescript-mode-hook #'setup-tide-mode)
        (flycheck-add-mode 'javascript-eslint 'web-mode)
        (flycheck-add-mode 'tsx-tide 'web-mode)
        (flycheck-add-mode 'typescript-tide 'web-mode)
        (flycheck-add-next-checker 'tsx-tide '(t . javascript-eslint) 'append)
        (flycheck-add-next-checker 'typescript-tide '(t . javascript-eslint) 'append)
        )
    #+END_SRC

    #+RESULTS:

    #+BEGIN_SRC emacs-lisp
      (require 'web-mode)
      (add-to-list 'auto-mode-alist '("\\.tsx\\'" . web-mode))
      (add-hook 'web-mode-hook
                (lambda ()
                  (when (string-equal "tsx" (file-name-extension buffer-file-name))
                    (setup-tide-mode)
                    (flycheck-select-checker 'tsx-tide))))
      (add-hook 'web-mode-hook
                (lambda ()
                  (when (string-equal "ts" (file-name-extension buffer-file-name))
                    (setup-tide-mode)
                    (flycheck-select-checker 'typescript-tide))))
      (add-to-list 'auto-mode-alist '("\\.ts\\'" . web-mode))

      (add-hook 'web-mode-hook
                (lambda ()
                  (when (string-equal "jsx" (file-name-extension buffer-file-name))
                    (setup-tide-mode))))

      (add-hook 'web-mode-hook
                (lambda ()
                  (when (string-equal "js" (file-name-extension buffer-file-name))
                    (setup-tide-mode))))
    #+END_SRC

    #+RESULTS:
    | lambda | nil | (when (string-equal js (file-name-extension buffer-file-name)) (setup-tide-mode))                                                         |
    | lambda | nil | (when (string-equal jsx (file-name-extension buffer-file-name)) (setup-tide-mode))                                                        |
    | lambda | nil | (when (string-equal ts (file-name-extension buffer-file-name)) (setup-tide-mode) (flycheck-select-checker (quote typescript-tide)))       |
    | lambda | nil | (when (string-equal tsx (file-name-extension buffer-file-name)) (setup-tide-mode) (flycheck-select-checker (quote tsx-tide)))             |
    | lambda | nil | (if (string-equal js (file-name-extension buffer-file-name)) (progn (setup-tide-mode)))                                                   |
    | lambda | nil | (if (string-equal jsx (file-name-extension buffer-file-name)) (progn (setup-tide-mode)))                                                  |
    | lambda | nil | (if (string-equal ts (file-name-extension buffer-file-name)) (progn (flycheck-select-checker (quote typescript-tide)) (setup-tide-mode))) |
    | lambda | nil | (if (string-equal tsx (file-name-extension buffer-file-name)) (progn (flycheck-select-checker (quote tsx-tide)) (setup-tide-mode)))       |

** LSP
   :PROPERTIES:
   :ID:       9c3e34ca-f041-421b-89ba-91bff5d0b55f
   :END:

   LSP sounds really cool [[https://langserver.org/]]

   Sounds like a really useful tool for any modern IDE

   #+begin_src emacs-lisp
     (use-package lsp-mode
       :ensure t
       :config
       (setq read-process-output-max (* 1024 1024))
       (setq lsp-auto-guess-root t        ; Detect project root
             lsp-keep-workspace-alive nil ; Auto-kill LSP server
             lsp-enable-indentation nil
             lsp-enable-on-type-formatting nil
             lsp-keymap-prefix "C-c l")
       )
   #+end_src

   #+RESULTS:
   : t

   Now to install the "UI"

   #+begin_src emacs-lisp
     (use-package lsp-ui
       :custom-face
       (lsp-ui-sideline-code-action ((t (:inherit warning))))
       :bind (("C-c u" . lsp-ui-imenu))
       :hook (lsp-mode . lsp-ui-mode)
       :init (setq lsp-ui-doc-enable t
                   lsp-ui-doc-use-webkit nil
                   lsp-ui-doc-delay 0.2
                   lsp-ui-doc-include-signature t
                   lsp-ui-doc-position 'at-point
                   lsp-ui-doc-border (face-foreground 'default)
                   lsp-eldoc-enable-hover nil ; Disable eldoc displays in minibuffer

                   lsp-ui-sideline-enable t
                   lsp-ui-sideline-show-hover nil
                   lsp-ui-sideline-show-diagnostics nil
                   lsp-ui-sideline-ignore-duplicate t

                   lsp-ui-imenu-enable t
                   lsp-ui-imenu-colors `(,(face-foreground 'font-lock-keyword-face)
                                         ,(face-foreground 'font-lock-string-face)
                                         ,(face-foreground 'font-lock-constant-face)
                                         ,(face-foreground 'font-lock-variable-name-face)))
       :config
       (add-to-list 'lsp-ui-doc-frame-parameters '(right-fringe . 8))

       ;; `C-g'to close doc
       (advice-add #'keyboard-quit :before #'lsp-ui-doc-hide)

       ;; Reset `lsp-ui-doc-background' after loading theme
       (add-hook 'after-load-theme-hook
                 (lambda ()
                   (setq lsp-ui-doc-border (face-foreground 'default))
                   (set-face-background 'lsp-ui-doc-background
                                        (face-background 'tooltip))))

       ;; WORKAROUND Hide mode-line of the lsp-ui-imenu buffer
       ;; @see https://github.com/emacs-lsp/lsp-ui/issues/243
       (defun my-lsp-ui-imenu-hide-mode-line ()
         "Hide the mode-line in lsp-ui-imenu."
         (setq mode-line-format nil))
       (advice-add #'lsp-ui-imenu :after #'my-lsp-ui-imenu-hide-mode-line))
   #+end_src

   #+RESULTS:
   : lsp-ui-imenu

   Now completion for company

   #+begin_src emacs-lisp
     ;;(use-package company-lsp
     ;;  :init (setq company-lsp-cache-candidates 'auto)
     ;;  :config
       ;;   (with-no-warnings
       ;;     ;; WORKAROUND: Fix tons of unrelated completion candidates shown
       ;;     ;; when a candidate is fulfilled
       ;;     ;; @see https://github.com/emacs-lsp/lsp-python-ms/issues/79
       ;;     (add-to-list 'company-lsp-filter-candidates '(mspyls))

       ;;     (defun my-company-lsp--on-completion (response prefix)
       ;;       "Handle completion RESPONSE.
       ;; PREFIX is a string of the prefix when the completion is requested.
       ;; Return a list of strings as the completion candidates."
       ;;       (let* ((incomplete (and (hash-table-p response) (gethash "isIncomplete" response)))
       ;;              (items (cond ((hash-table-p response) (gethash "items" response))
       ;;                           ((sequencep response) response)))
       ;;              (candidates (mapcar (lambda (item)
       ;;                                    (company-lsp--make-candidate item prefix))
       ;;                                  (lsp--sort-completions items)))
       ;;              (server-id (lsp--client-server-id (lsp--workspace-client lsp--cur-workspace)))
       ;;              (should-filter (or (eq company-lsp-cache-candidates 'auto)
       ;;                                 (and (null company-lsp-cache-candidates)
       ;;                                      (company-lsp--get-config company-lsp-filter-candidates server-id)))))
       ;;         (when (null company-lsp--completion-cache)
       ;;           (add-hook 'company-completion-cancelled-hook #'company-lsp--cleanup-cache nil t)
       ;;           (add-hook 'company-completion-finished-hook #'company-lsp--cleanup-cache nil t))
       ;;         (when (eq company-lsp-cache-candidates 'auto)
       ;;           ;; Only cache candidates on auto mode. If it's t company caches the
       ;;           ;; candidates for us.
       ;;           (company-lsp--cache-put prefix (company-lsp--cache-item-new candidates incomplete)))
       ;;         (if should-filter
       ;;             (company-lsp--filter-candidates candidates prefix)
       ;;           candidates)))
       ;;     (advice-add #'company-lsp--on-completion :override #'my-company-lsp--on-completion)))
   #+end_src

   #+RESULTS:

   I am a helm user so HELM ALL THE WAY!

   #+begin_src emacs-lisp
                                             ;(use-package helm-lsp
                                             ;  :commands helm-lsp-workspace-symbol)
   #+end_src

   #+RESULTS:

   python lsp test
   #+begin_src emacs-lisp
     (use-package lsp-python-ms
       :hook (python-mode . (lambda () (require 'lsp-python-ms))))
   #+end_src

   #+RESULTS:
   | (lambda nil (require (quote lsp-python-ms))) | doom-modeline-env-setup-python | jedi:setup | elpy-mode | #[0  |
* Terminal
  :PROPERTIES:
  :ID:       fcd46ccd-8315-4a90-92a3-021687aeef03
  :END:

  For a while I used =shell-pop= for shell sessions but I'm now transitioning
  to using =multi-term= and =vterm= to manage my shell sessions. It's bound to =C-c t=.

  #+BEGIN_SRC emacs-lisp
    (print "Loading terminal configs")
    (use-package multi-term
      :straight t)

    (use-package vterm
      :straight (vterm :type git :host github :repo "akermu/emacs-libvterm" :branch "master"))
    (load-file "~/.emacs.d/resources/multi-libvterm.d/multi-libvterm.el")

    (global-set-key (kbd "C-c t") 'multi-libvterm)

    ;; if nix is installed use fish as shell
    (if (file-directory-p "~/.nix-profile/")
        (setq multi-libvterm-program "~/.nix-profile/bin/fish"))
  #+END_SRC

  #+RESULTS:
  : ~/.nix-profile/bin/fish

  Use a login shell:

  #+BEGIN_SRC emacs-lisp
    (setq multi-term-program-switches "--login")
  #+END_SRC

  #+RESULTS:
  : --login

  I'd rather not use Evil in the terminal. It's not especially useful (I don't use
  vi bindings in xterm) and it shadows useful keybindings (=C-d= for EOF, for
  example).

  #+BEGIN_SRC emacs-lisp
                                            ; (evil-set-initial-state 'term-mode 'emacs)
  #+END_SRC

  #+RESULTS:

  I add a bunch of hooks to =term-mode=:

  - I'd like links (URLs, etc) to be clickable.
  - Yanking in =term-mode= doesn't quite work. The text from the paste appears in
    the buffer but isn't sent to the shell process. This correctly binds =C-y= and
    middle-click to yank the way we'd expect.
  - I bind =M-o= to quickly change windows. I'd like that in terminals, too.
  - I don't want to perform =yasnippet= expansion when tab-completing.

  #+begin_src emacs-lisp
    (defun ajc/term-paste (&optional string)
      (interactive)
      (process-send-string
       (get-buffer-process (current-buffer))
       (if string string (current-kill 0))))
  #+end_src

  #+RESULTS:
  : ajc/term-paste

  #+begin_src emacs-lisp
    (global-set-key (kbd "M-n") 'multi-libvterm-next)
    (global-set-key (kbd "M-p") 'multi-libvterm-prev)
    (add-hook 'vterm-mode-hook
              (lambda ()
                (linum-mode 0)
                (goto-address-mode)
                (setq comint-process-echoes t)
                (define-key vterm-mode-map (kbd "M-n") 'multi-libvterm-next)
                (define-key vterm-mode-map (kbd "M-p") 'multi-libvterm-prev)
                (defun vterm-send-Cright ()
                  (interactive)
                  (vterm-send-key "<right>" nil nil t))
                (defun vterm-send-Cleft  ()
                  (interactive)
                  (vterm-send-key "<left>" nil nil t))
                (define-key vterm-mode-map (kbd "C-<right>")      'vterm-send-Cright)
                (define-key vterm-mode-map (kbd "C-<left>")       'vterm-send-Cleft)
                (define-key vterm-mode-map (kbd "C-y") 'ajc/term-paste)
                (define-key vterm-mode-map (kbd "C-q") nil)))
  #+end_src

  #+RESULTS:
  | lambda | nil | (linum-mode 0) | (goto-address-mode) | (setq comint-process-echoes t) | (define-key vterm-mode-map (kbd M-n) (quote multi-libvterm-next)) | (define-key vterm-mode-map (kbd M-p) (quote multi-libvterm-prev)) | (defun vterm-send-Cright nil (interactive) (vterm-send-key <right> nil nil t))                                | (defun vterm-send-Cleft nil (interactive) (vterm-send-key <left> nil nil t))                                | (define-key vterm-mode-map (kbd C-<right>) (quote vterm-send-Cright)) | (define-key vterm-mode-map (kbd C-<left>) (quote vterm-send-Cleft)) | (define-key vterm-mode-map (kbd C-y) (quote ajc/term-paste)) | (define-key vterm-mode-map (kbd C-q) nil) |
  | lambda | nil | (linum-mode 0) | (goto-address-mode) | (setq comint-process-echoes t) | (define-key vterm-mode-map (kbd M-n) (quote multi-libvterm-next)) | (define-key vterm-mode-map (kbd M-p) (quote multi-libvterm-prev)) | (defalias (quote vterm-send-Cright) (function (lambda nil (interactive) (vterm-send-key <right> nil nil t)))) | (defalias (quote vterm-send-Cleft) (function (lambda nil (interactive) (vterm-send-key <left> nil nil t)))) | (define-key vterm-mode-map (kbd C-<right>) (quote vterm-send-Cright)) | (define-key vterm-mode-map (kbd C-<left>) (quote vterm-send-Cleft)) | (define-key vterm-mode-map (kbd C-y) (quote ajc/term-paste)) | (define-key vterm-mode-map (kbd C-q) nil) |

  #+BEGIN_SRC emacs-lisp
    (add-hook 'term-mode-hook
              (lambda ()
                (linum-mode 0)
                (goto-address-mode)
                (setq comint-process-echoes t)
                (define-key term-raw-map (kbd "C-y") 'ajc/term-paste)
                (define-key term-raw-map (kbd "<mouse-2>") 'ajc/term-paste)
                (define-key term-raw-map (kbd "M-o") 'other-window)
                (define-key term-raw-map (kbd "M-n") 'multi-term-next)
                (define-key term-raw-map (kbd "M-p") 'multi-term-prev)
                (defun term-send-Cr () (interactive) (term-send-raw-string "\C-r"))
                                            ;(evil-local-set-key 'insert (kbd "C-r") 'term-send-Cr)
                (define-key term-raw-map (kbd "C-r")      'term-send-Cr)
                (defun term-send-tab () (interactive) (term-send-raw-string "\t") )
                (define-key term-raw-map (kbd "TAB")      'term-send-tab)
                (define-key term-raw-map (kbd "<tab>")      'term-send-tab)
                (defun term-send-Cspc () (interactive) (term-send-raw-string (string 0)))
                (define-key term-raw-map (kbd "M-SPC") 'term-send-Cspc)
                (define-key term-raw-map (kbd "C-t") 'term-send-Cspc)
                (setq indent-tabs-mode nil)
                (setq tab-width 0)
                (defun term-send-Cright () (interactive) (term-send-raw-string "\e[1;5C"))
                (defun term-send-Cleft  () (interactive) (term-send-raw-string "\e[1;5D"))
                (define-key term-raw-map (kbd "C-<right>")      'term-send-Cright)
                (define-key term-raw-map (kbd "C-<left>")       'term-send-Cleft)
                (yas-minor-mode -1)
                (setq global-hl-line-mode nil)
                (setq bidi-paragraph-direction 'left-to-right)
                ))
  #+END_SRC

  #+RESULTS:
  | lambda | nil | (linum-mode 0) | (goto-address-mode) | (setq comint-process-echoes t) | (define-key term-raw-map (kbd C-y) (quote ajc/term-paste)) | (define-key term-raw-map (kbd <mouse-2>) (quote ajc/term-paste)) | (define-key term-raw-map (kbd M-o) (quote other-window)) | (define-key term-raw-map (kbd M-n) (quote multi-term-next)) | (define-key term-raw-map (kbd M-p) (quote multi-term-prev)) | (defun term-send-Cr nil (interactive) (term-send-raw-string ))                                | (define-key term-raw-map (kbd C-r) (quote term-send-Cr)) | (defun term-send-tab nil (interactive) (term-send-raw-string 	))                                | (define-key term-raw-map (kbd TAB) (quote term-send-tab)) | (define-key term-raw-map (kbd <tab>) (quote term-send-tab)) | (defun term-send-Cspc nil (interactive) (term-send-raw-string (string 0)))                                | (define-key term-raw-map (kbd M-SPC) (quote term-send-Cspc)) | (define-key term-raw-map (kbd C-t) (quote term-send-Cspc)) | (setq indent-tabs-mode nil) | (setq tab-width 0) | (defun term-send-Cright nil (interactive) (term-send-raw-string [1;5C))                                | (defun term-send-Cleft nil (interactive) (term-send-raw-string [1;5D))                                | (define-key term-raw-map (kbd C-<right>) (quote term-send-Cright)) | (define-key term-raw-map (kbd C-<left>) (quote term-send-Cleft)) | (yas-minor-mode -1) | (setq global-hl-line-mode nil) | (setq bidi-paragraph-direction (quote left-to-right)) |
  | lambda | nil | (linum-mode 0) | (goto-address-mode) | (setq comint-process-echoes t) | (define-key term-raw-map (kbd C-y) (quote ajc/term-paste)) | (define-key term-raw-map (kbd <mouse-2>) (quote ajc/term-paste)) | (define-key term-raw-map (kbd M-o) (quote other-window)) | (define-key term-raw-map (kbd M-n) (quote multi-term-next)) | (define-key term-raw-map (kbd M-p) (quote multi-term-prev)) | (defalias (quote term-send-Cr) (function (lambda nil (interactive) (term-send-raw-string )))) | (define-key term-raw-map (kbd C-r) (quote term-send-Cr)) | (defalias (quote term-send-tab) (function (lambda nil (interactive) (term-send-raw-string 	)))) | (define-key term-raw-map (kbd TAB) (quote term-send-tab)) | (define-key term-raw-map (kbd <tab>) (quote term-send-tab)) | (defalias (quote term-send-Cspc) (function (lambda nil (interactive) (term-send-raw-string (string 0))))) | (define-key term-raw-map (kbd M-SPC) (quote term-send-Cspc)) | (define-key term-raw-map (kbd C-t) (quote term-send-Cspc)) | (setq indent-tabs-mode nil) | (setq tab-width 0) | (defalias (quote term-send-Cright) (function (lambda nil (interactive) (term-send-raw-string [1;5C)))) | (defalias (quote term-send-Cleft) (function (lambda nil (interactive) (term-send-raw-string [1;5D)))) | (define-key term-raw-map (kbd C-<right>) (quote term-send-Cright)) | (define-key term-raw-map (kbd C-<left>) (quote term-send-Cleft)) | (yas-minor-mode -1) | (setq global-hl-line-mode nil) | (setq bidi-paragraph-direction (quote left-to-right)) |

  I have this really cool function so I can send regions to a terminal. Really
  andy when you want to execute selections without copying and pasting

  #+BEGIN_SRC emacs-lisp
    ;;
    ;; Send region to running emacs process
    ;;
    (global-set-key (kbd "C-u") #'tws-region-to-process)
    (defun tws-region-to-process (arg beg end)
      "Send the current region to a process buffer.
    The first time it's called, will prompt for the buffer to
    send to. Subsequent calls send to the same buffer, unless a
    prefix argument is used (C-u), or the buffer no longer has an
    active process."
      (interactive "P\nr")
      (when (or arg ;; user asks for selection
                (not (boundp 'tws-process-target)) ;; target not set
                ;; or target is not set to an active process:
                (not (process-live-p (get-buffer-process tws-process-target))))
        (let (procs buf)
          (setq procs (remove nil (seq-map
                                   (lambda (el)
                                     (when (setq buf (process-buffer el))
                                       (buffer-name buf)))
                                   (process-list))))
          (if (not procs) (error "No process buffers currently open.")
            (setq tws-process-target (completing-read "Process: " procs)))))
                                            ;(process-send-region tws-process-target beg end))
      (process-send-string tws-process-target (buffer-substring beg end)))
  #+END_SRC

	#+RESULTS:
  : tws-region-to-process

  Sometimes I want to cut things from the terminal into another buffer,
  so here I can switch from one to another

  #+BEGIN_SRC emacs-lisp
    (global-set-key (kbd "C-c C-j") 'term-line-mode)
    (global-set-key (kbd "C-c C-k") 'term-char-mode)
  #+END_SRC

  #+RESULTS:
  : term-char-mode

** Org base
   :PROPERTIES:
   :ID:       09a87754-1cc0-4a18-bf16-8c011787d4ab
   :END:

   First we will define some high level 'constants' related to org

   #+begin_src emacs-lisp
     (setq org-directory "~/org/")
     (setq org-journal-directory (f-join org-directory "journal"))
     (setq org-roam-directory org-directory)

     ;; Roam related directories (relative to org dir)
     (setq org-roam-link-dir "links/${slug}")
     (setq org-map-dir (f-join "map" "${slug}"))
   #+end_src

   #+RESULTS:
   : map/${slug}

   Now we will setup the visual based settings for org mode

   #+begin_src emacs-lisp
     ;; I like seeing a little downward-pointing arrow instead of the usual ellipsis
     ;; (=...=) that org displays when there's stuff under a header.
     (setq org-ellipsis "")

     ;; Use syntax highlighting in source blocks while editing.
     (setq org-src-fontify-natively t)

     ;; Make TAB act as if it were issued in a buffer of the language's major mode.
     (setq org-src-tab-acts-natively t)

     ;; When editing a code snippet, use the current window rather than popping open a
     ;; new one (which shows the same information).
     (setq org-src-window-setup 'current-window)

     ;; I like shift selection, importing old knowledge...
     (setq org-support-shift-select t)

   #+end_src

   #+RESULTS:
   : t

   Now we will define some useful functions for path manipulation, repo management, etc.

   #+begin_src emacs-lisp
     ;; Setup main org repo
     (defun ajc/setup-org-repo ()
       "Install org "
       (interactive)
       (let ((auto-answer t))
         (if (not (f-dir? org-directory))
             (magit-clone-regular "git@github.com:cmrfrd/org.git" (getenv "HOME") '()))))


     ;; Appenda  filename to the root org dir
     (defun org-file-path (filename)
       "Return the absolute address of an org file, given its relative name."
       (concat (file-name-as-directory org-directory) filename))
   #+end_src

   #+RESULTS:
   : org-file-path

** Setup org
   :PROPERTIES:
   :ID:       ba3b3575-e09b-4876-8f69-0440004b1300
   :END:

   Now we will setup base org mode

   #+BEGIN_SRC emacs-lisp
     (use-package org
       :ensure org-plus-contrib
       :hook
       (before-save . zp/org-set-last-modified))

     (push 'company-capf company-backends)

     (defun add-pcomplete-to-capf ()
       (add-hook 'completion-at-point-functions 'pcomplete-completions-at-point nil t))

     (add-hook 'org-mode-hook #'add-pcomplete-to-capf)
   #+END_SRC

   #+RESULTS:
   | org-tempo-setup | (lambda nil (delete (quote (\.pdf\' . default)) org-file-apps) (add-to-list (quote org-file-apps) (quote (\.pdf\' . zathura %s)))) | org-ref-org-menu | org-bullets-mode | (lambda nil (require (quote org-tempo))) | add-pcomplete-to-capf | (closure (org-agenda-skip-regexp org-table1-hline-regexp org-table-tab-recognizes-table.el org-table-dataline-regexp org-table-any-border-regexp org-agenda-restriction-lock-overlay org-agenda-overriding-restriction org-agenda-diary-file org-complex-heading-regexp t) nil (setq imenu-create-index-function (quote org-imenu-get-tree))) | evil-org-mode | (closure (org--rds reftex-docstruct-symbol org-element-greater-elements org-clock-history org-agenda-current-date org-with-time org-defdecode org-def org-read-date-inactive org-ans2 org-ans1 org-columns-current-fmt-compiled org-clock-current-task org-clock-effort org-agenda-skip-function org-agenda-skip-comment-trees org-agenda-archives-mode org-end-time-was-given org-time-was-given org-log-note-extra org-log-note-purpose org-log-post-message org-last-inserted-timestamp org-last-changed-timestamp org-entry-property-inherited-from org-blocked-by-checkboxes org-state org-agenda-headline-snapshot-before-repeat org-agenda-start-on-weekday org-agenda-buffer-tmp-name org-priority-regexp org-mode-abbrev-table org-mode-syntax-table buffer-face-mode-face org-tbl-menu org-org-menu org-struct-menu org-entities org-last-state org-id-track-globally org-clock-start-time texmathp-why remember-data-file org-agenda-tags-todo-honor-ignore-options iswitchb-temp-buflist calc-embedded-open-mode calc-embedded-open-formula calc-embedded-close-formula align-mode-rules-list org-emphasis-alist org-emphasis-regexp-components org-export-registered-backends org-modules org-babel-load-languages org-id-overriding-file-name org-indent-indentation-per-level org-element-paragraph-separate ffap-url-regexp org-inlinetask-min-level t) nil (add-hook (quote change-major-mode-hook) (quote org-show-all) (quote append) (quote local))) | (closure (org-src-window-setup *this* org-babel-confirm-evaluate-answer-no org-babel-tangle-uncomment-comments org-src-preserve-indentation org-src-lang-modes org-edit-src-content-indentation org-babel-library-of-babel t) nil (add-hook (quote change-major-mode-hook) (quote org-babel-show-result-all) (quote append) (quote local))) | org-babel-result-hide-spec | org-babel-hide-all-hashes | org-eldoc-load | org-ref-setup-label-finders |

   Now we will add some hooks

   #+begin_src emacs-lisp
     ;; specific thing with italics and stuff
     (with-eval-after-load 'org
       (setcar (nthcdr 4 org-emphasis-regexp-components) 10)
       (org-set-emph-re 'org-emphasis-regexp-components org-emphasis-regexp-components))

     (add-to-list 'org-modules 'org-tempo)
     (add-hook 'org-mode-hook
               (lambda ()
                 (require 'org-tempo)))
   #+end_src

   #+RESULTS:
   | org-tempo-setup | (lambda nil (delete (quote (\.pdf\' . default)) org-file-apps) (add-to-list (quote org-file-apps) (quote (\.pdf\' . zathura %s)))) | org-ref-org-menu | org-bullets-mode | (lambda nil (require (quote org-tempo))) | add-pcomplete-to-capf | (closure (org-agenda-skip-regexp org-table1-hline-regexp org-table-tab-recognizes-table.el org-table-dataline-regexp org-table-any-border-regexp org-agenda-restriction-lock-overlay org-agenda-overriding-restriction org-agenda-diary-file org-complex-heading-regexp t) nil (setq imenu-create-index-function (quote org-imenu-get-tree))) | evil-org-mode | (closure (org--rds reftex-docstruct-symbol org-element-greater-elements org-clock-history org-agenda-current-date org-with-time org-defdecode org-def org-read-date-inactive org-ans2 org-ans1 org-columns-current-fmt-compiled org-clock-current-task org-clock-effort org-agenda-skip-function org-agenda-skip-comment-trees org-agenda-archives-mode org-end-time-was-given org-time-was-given org-log-note-extra org-log-note-purpose org-log-post-message org-last-inserted-timestamp org-last-changed-timestamp org-entry-property-inherited-from org-blocked-by-checkboxes org-state org-agenda-headline-snapshot-before-repeat org-agenda-start-on-weekday org-agenda-buffer-tmp-name org-priority-regexp org-mode-abbrev-table org-mode-syntax-table buffer-face-mode-face org-tbl-menu org-org-menu org-struct-menu org-entities org-last-state org-id-track-globally org-clock-start-time texmathp-why remember-data-file org-agenda-tags-todo-honor-ignore-options iswitchb-temp-buflist calc-embedded-open-mode calc-embedded-open-formula calc-embedded-close-formula align-mode-rules-list org-emphasis-alist org-emphasis-regexp-components org-export-registered-backends org-modules org-babel-load-languages org-id-overriding-file-name org-indent-indentation-per-level org-element-paragraph-separate ffap-url-regexp org-inlinetask-min-level t) nil (add-hook (quote change-major-mode-hook) (quote org-show-all) (quote append) (quote local))) | (closure (org-src-window-setup *this* org-babel-confirm-evaluate-answer-no org-babel-tangle-uncomment-comments org-src-preserve-indentation org-src-lang-modes org-edit-src-content-indentation org-babel-library-of-babel t) nil (add-hook (quote change-major-mode-hook) (quote org-babel-show-result-all) (quote append) (quote local))) | org-babel-result-hide-spec | org-babel-hide-all-hashes | org-eldoc-load | org-ref-setup-label-finders |

   Now we will install all the frivolous org package

   #+begin_src emacs-lisp
     (use-package ox-reveal :ensure t)
     (use-package ob-go :ensure t)
     (use-package ox-gfm
       :ensure t
       :config
       (eval-after-load "org"
         '(require 'ox-gfm nil t)))
     (use-package org-bullets
       :init
       (add-hook 'org-mode-hook 'org-bullets-mode))
   #+end_src

** Task and org-capture management
   :PROPERTIES:
   :ID:       3fcb0c82-784a-41b0-91a6-6b4f491e93ca
   :END:

   Store my org files in =notes/org=, maintain an inbox in Dropbox, define
   the location of an index file (my main todo list), and archive finished tasks in
   =notes/org/archive.org=.

   #+BEGIN_SRC emacs-lisp
     (setq org-inbox-file (org-file-path "inbox.org"))
     (setq org-index-file (org-file-path "index.org"))
     (setq org-archive-location
           (concat (org-file-path "archive.org") "::* From %s"))
   #+END_SRC

   #+RESULTS:
   : ~/org/archive.org::* From %s

   I use [[http://agiletortoise.com/drafts/][Drafts]] to create new tasks, format them according to a template, and
   append them to an "inbox.org" file in my Dropbox. This function lets me import
   them easily from that inbox file to my index.

   #+BEGIN_SRC emacs-lisp
     (defun ajc/copy-tasks-from-inbox ()
       (when (file-exists-p org-inbox-file)
         (save-excursion
           (find-file org-index-file)
           (goto-char (point-max))
           (insert-file-contents org-inbox-file)
           (delete-file org-inbox-file))))
   #+END_SRC

   #+RESULTS:
   : ajc/copy-tasks-from-inbox

   I store all my todos in =index.org=, so I'd like to derive my
   agenda from there.

   #+BEGIN_SRC emacs-lisp
                                             ; (setq org-agenda-files (list org-index-file))
   #+END_SRC

	 #+RESULTS:

   Hitting =C-c C-x C-s= will mark a todo as done and move it to an appropriate
   place in the archive.

   #+BEGIN_SRC emacs-lisp
     (defun ajc/mark-done-and-archive ()
       "Mark the state of an org-mode item as DONE and archive it."
       (interactive)
       (org-todo 'done)
       (org-archive-subtree))

     (define-key org-mode-map (kbd "C-c C-x C-s") 'ajc/mark-done-and-archive)
   #+END_SRC

   #+RESULTS:
   : ajc/mark-done-and-archive

   Record the time that a todo was archived.

   #+BEGIN_SRC emacs-lisp
     (setq org-log-done 'time)
   #+END_SRC

** Exporting
   :PROPERTIES:
   :ID:       fdc5b1ae-a873-472a-8ff0-f4086e9fd287
   :END:

   Allow export to markdown and beamer (for presentations).

   #+BEGIN_SRC emacs-lisp
     (require 'ox-md)
     (require 'ox-beamer)
   #+END_SRC

   #+RESULTS:
   : ox-beamer

   Allow =babel= to evaluate Emacs lisp, Ruby, dot, or Gnuplot code.

   #+BEGIN_SRC emacs-lisp
     (use-package gnuplot)

     (org-babel-do-load-languages
      'org-babel-load-languages
      '((emacs-lisp . t)
        (ruby . t)
        (shell . t)
        (plantuml . t)
        (dot . t)
        (docker-build . t)
        (gnuplot . t)))
   #+END_SRC

   #+RESULTS:

   Don't ask before evaluating code blocks.

   #+BEGIN_SRC emacs-lisp
     (setq org-confirm-babel-evaluate nil)
   #+END_SRC

   #+RESULTS:

   Associate the "dot" language with the =graphviz-dot= major mode.

   #+BEGIN_SRC emacs-lisp
     (use-package graphviz-dot-mode)
     (add-to-list 'org-src-lang-modes '("dot" . graphviz-dot))
   #+END_SRC

   #+RESULTS:
   : ((dot . graphviz-dot) (redis . redis) (php . php) (arduino . arduino) (C . c) (C++ . c++) (asymptote . asy) (bash . sh) (beamer . latex) (calc . fundamental) (cpp . c++) (ditaa . artist) (dot . fundamental) (elisp . emacs-lisp) (ocaml . tuareg) (screen . shell-script) (shell . sh) (sqlite . sql))

   Translate regular ol' straight quotes to typographically-correct curly quotes
   when exporting.

   #+BEGIN_SRC emacs-lisp
     (setq org-export-with-smart-quotes t)
   #+END_SRC

   #+RESULTS:
   : t

**** Exporting to PDF
     :PROPERTIES:
     :ID:       e2c1a0ca-85a0-4e1b-a3d9-dd9031a29833
     :END:

     I want to produce PDFs with syntax highlighting in the code. The best way to do
     that seems to be with the =minted= package, but that package shells out to
     =pygments= to do the actual work. =pdflatex= usually disallows shell commands;
     this enables that.

     #+BEGIN_SRC emacs-lisp
       (setq org-latex-pdf-process
             '("xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
               "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
               "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
     #+END_SRC

     #+RESULTS:
     | xelatex -shell-escape -interaction nonstopmode -output-directory %o %f | xelatex -shell-escape -interaction nonstopmode -output-directory %o %f | xelatex -shell-escape -interaction nonstopmode -output-directory %o %f |

     Include the =minted= package in all of my LaTeX exports.

     #+BEGIN_SRC emacs-lisp
       (add-to-list 'org-latex-packages-alist '("" "minted"))
       (setq org-latex-listings 'minted)
     #+END_SRC

** TeX configuration
   :PROPERTIES:
   :ID:       31a1125c-3e99-4549-bfd8-e45c28bd82c2
   :END:

   I rarely write LaTeX directly any more, but I often export through it with
   org-mode, so I'm keeping them together.

   Automatically parse the file after loading it.

   #+BEGIN_SRC emacs-lisp
     (setq TeX-parse-self t)
   #+END_SRC

	 #+RESULTS:
   : t

   Always use =pdflatex= when compiling LaTeX documents. I don't really have any
   use for DVIs.

   #+BEGIN_SRC emacs-lisp
     (setq TeX-PDF-mode t)
   #+END_SRC

	 #+RESULTS:
   : t

   Open compiled PDFs in =zathura= instead of in the editor.

   #+BEGIN_SRC emacs-lisp
     (add-hook 'org-mode-hook
               '(lambda ()
                  (delete '("\\.pdf\\'" . default) org-file-apps)
                  (add-to-list 'org-file-apps '("\\.pdf\\'" . "zathura %s"))))
   #+END_SRC

	 #+RESULTS:
   | org-tempo-setup | (lambda nil (delete (quote (\.pdf\' . default)) org-file-apps) (add-to-list (quote org-file-apps) (quote (\.pdf\' . zathura %s)))) | org-ref-org-menu | org-bullets-mode | (lambda nil (require (quote org-tempo))) | add-pcomplete-to-capf | (closure (org-agenda-skip-regexp org-table1-hline-regexp org-table-tab-recognizes-table.el org-table-dataline-regexp org-table-any-border-regexp org-agenda-restriction-lock-overlay org-agenda-overriding-restriction org-agenda-diary-file org-complex-heading-regexp t) nil (setq imenu-create-index-function (quote org-imenu-get-tree))) | evil-org-mode | (closure (org--rds reftex-docstruct-symbol org-element-greater-elements org-clock-history org-agenda-current-date org-with-time org-defdecode org-def org-read-date-inactive org-ans2 org-ans1 org-columns-current-fmt-compiled org-clock-current-task org-clock-effort org-agenda-skip-function org-agenda-skip-comment-trees org-agenda-archives-mode org-end-time-was-given org-time-was-given org-log-note-extra org-log-note-purpose org-log-post-message org-last-inserted-timestamp org-last-changed-timestamp org-entry-property-inherited-from org-blocked-by-checkboxes org-state org-agenda-headline-snapshot-before-repeat org-agenda-start-on-weekday org-agenda-buffer-tmp-name org-priority-regexp org-mode-abbrev-table org-mode-syntax-table buffer-face-mode-face org-tbl-menu org-org-menu org-struct-menu org-entities org-last-state org-id-track-globally org-clock-start-time texmathp-why remember-data-file org-agenda-tags-todo-honor-ignore-options iswitchb-temp-buflist calc-embedded-open-mode calc-embedded-open-formula calc-embedded-close-formula align-mode-rules-list org-emphasis-alist org-emphasis-regexp-components org-export-registered-backends org-modules org-babel-load-languages org-id-overriding-file-name org-indent-indentation-per-level org-element-paragraph-separate ffap-url-regexp org-inlinetask-min-level t) nil (add-hook (quote change-major-mode-hook) (quote org-show-all) (quote append) (quote local))) | (closure (org-src-window-setup *this* org-babel-confirm-evaluate-answer-no org-babel-tangle-uncomment-comments org-src-preserve-indentation org-src-lang-modes org-edit-src-content-indentation org-babel-library-of-babel t) nil (add-hook (quote change-major-mode-hook) (quote org-babel-show-result-all) (quote append) (quote local))) | org-babel-result-hide-spec | org-babel-hide-all-hashes | org-eldoc-load | org-ref-setup-label-finders |

   Enable a minor mode for dealing with math (it adds a few useful keybindings),
   and always treat the current file as the "main" file. That's intentional, since
   I'm usually actually in an org document.

   #+BEGIN_SRC emacs-lisp
     (add-hook 'LaTeX-mode-hook
               (lambda ()
                 (LaTeX-math-mode)
                 (setq TeX-master t)))
   #+END_SRC

** Configure =yasnippet=
   :PROPERTIES:
   :ID:       43890000-b899-4234-b7da-a76fbf62fd54
   :END:

   #+BEGIN_SRC emacs-lisp
     (use-package yasnippet :ensure t)
     (add-to-list 'company-backends 'company-yasnippet)
   #+END_SRC

   #+RESULTS:
   | company-capf | company-yasnippet | company-capf | company-bbdb | company-semantic | company-cmake | company-capf | company-clang | company-files | (company-dabbrev-code company-gtags company-etags company-keywords) | company-oddmuse | company-dabbrev |

   I keep my snippets in =~/.emacs/snippets/text-mode=, and I always want =yasnippet=
   enabled.

   #+BEGIN_SRC emacs-lisp
                                             ; (setq yas-snippet-dirs '("~/.emacs.d/snippets/text-mode"))
     (yas-global-mode 1)
   #+END_SRC

   #+RESULTS:
   : t

   I /dont/ want =yas= to automatically indent the snippets it inserts. Sometimes
   this looks pretty bad (when indenting org-mode, for example, or trying to guess
   at the correct indentation for Python).

   #+BEGIN_SRC emacs-lisp
     (setq yas/indent-line nil)
   #+END_SRC

** Disable helm in some common emacs apps
   :PROPERTIES:
   :ID:       e9f2d505-bd52-4e49-b963-6ad8081eea39
   :END:

   #+BEGIN_SRC emacs-lisp
     ;; Disable Helm in the following functions.
     ;; See: https://github.com/emacs-helm/helm/wiki#customize-helm-mode
     (setq helm-completing-read-handlers-alist
           '((magit-gitignore . nil)
             (rename-file . ido)))
   #+END_SRC

   #+RESULTS:
   : ((magit-gitignore) (rename-file . ido))

** auxilary helm
   :PROPERTIES:
   :ID:       b36942c1-2849-4230-a140-e7ccdcb3bd5f
   :END:

   This section is mainly for emacs...helm...packages...

   #+BEGIN_SRC emacs-lisp
     ;; Install accompanying helm packages
     (use-package helm-projectile
       :ensure t
       :init
       (setq projectile-completion-system 'helm)
       (helm-projectile-on))
     (use-package helm-tramp
       :ensure t
       :bind ("C-c s" . helm-tramp))
     (setq tramp-default-method "docker")
   #+END_SRC

   #+RESULTS:
   : docker


   Just a few handy functions.

   #+BEGIN_SRC emacs-lisp
     (global-set-key (kbd "M-o") 'other-window)
   #+END_SRC

   #+RESULTS:
   : other-window

   Remap when working in terminal Emacs.

   #+BEGIN_SRC emacs-lisp
     (define-key input-decode-map "\e[1;2A" [S-up])
   #+END_SRC

   #+RESULTS:
   : [S-up]

   I like enlarging and shrinking windows easily

   #+BEGIN_SRC emacs-lisp
     ;; hotkey window resizingx
     (global-set-key (kbd "C-M-<left>") 'shrink-window-horizontally)
     (global-set-key (kbd "C-M-<right>") 'enlarge-window-horizontally)
     (global-set-key (kbd "C-M-<down>") 'shrink-window)
     (global-set-key (kbd "C-M-<up>") 'enlarge-window)
   #+END_SRC

   #+RESULTS:
   : enlarge-window

   Also switching between windows

   #+BEGIN_SRC emacs-lisp
     ;; window switching hotkeys
     (global-set-key (kbd "C-c <left>")  'windmove-left)
     (global-set-key (kbd "C-c <right>") 'windmove-right)
     (global-set-key (kbd "C-c <up>")    'windmove-up)
     (global-set-key (kbd "C-c <down>")  'windmove-down)
   #+END_SRC

   #+RESULTS:
   : windmove-down

   Nice sliding window scrolling

   #+BEGIN_SRC emacs-lisp
     ;; hotkey scrolling
     (defun next-line-and-recenter () (interactive) (next-line) (recenter))
     (defun previous-line-and-recenter () (interactive) (previous-line) (recenter))
     (global-set-key (kbd "C-n") 'next-line-and-recenter)
     (global-set-key (kbd "C-p") 'previous-line-and-recenter)
   #+END_SRC

   #+RESULTS:
   : previous-line-and-recenter

   Run polybar in the background

   #+begin_src emacs-lisp
     (defun kill_polybar ()
       (let ((auto-answer t))
         (when (get-buffer "*trigger_polybar*")
           (kill-buffer "*trigger_polybar*"))))


     (defun trigger_polybar (&optional default-monitor)
       (interactive)
       (unless default-monitor (setq default-monitor ""))
       (kill_polybar)
       (let ((display-buffer-alist
              (cons (cons "\\*trigger_polybar\\*.*"
                          (cons #'display-buffer-no-window nil))
                    display-buffer-alist))) ;; suppress async shell command window
         (async-shell-command
          (concat "trigger_polybar " default-monitor) "*trigger_polybar*")))
   #+end_src

   #+RESULTS:
   : trigger_polybar

* EXWM
  :PROPERTIES:
  :ID:       530ded90-f950-4cb6-bd8f-ab73a304f7af
  :END:

  An attempt to switch from i3 to a better X window manager is EXWM.

  In my opinion it is a pretty amazing blend of X and emacs

  #+BEGIN_SRC emacs-lisp
    (print "Loading exwm configs")

    (eval-and-compile
      (straight-use-package 'exwm)
      (require 'exwm-core))

    (use-package exwm
      :straight t
      :config
      (require 'exwm-config)
      (exwm-enable)

      ;; Make a bunch of workspaces
      (setq exwm-workspace-number 4)
      (dotimes (i 4)
        (exwm-input-set-key (kbd (format "s-%d" i))
                            `(lambda ()
                               (interactive)
                               (exwm-workspace-switch-create ,i))))

      ;; config vars
      (setq exwm-manage-codnfigurations '((t line-mode t)))
      (setq exwm-workspace-show-all-buffers t)
      (setq exwm-layout-show-all-buffers t)

      (define-key exwm-mode-map [?\C-q] 'exwm-input-send-next-key)
      (define-key exwm-mode-map (kbd "C-c") nil)

      (defun exwm-workspace--current-to-previous-index (_x)
        (setq exwm-workspace-previous-index exwm-workspace-current-index))

      (defun exwm-workspace-previous ()
        (interactive)
        "Switch to the previous workspace."
        (let ((index exwm-workspace-current-index))
          (if (= index 0)
              (exwm-workspace-switch (- exwm-workspace-number 1))
            (exwm-workspace-switch (% (- index 1) exwm-workspace-number)))))

      (defun exwm-workspace-next ()
        (interactive)
        "Switch to the next workspace."
        (let ((index exwm-workspace-current-index))
          (exwm-workspace-switch (% (+ index 1) exwm-workspace-number))))

      (exwm-input-set-key (kbd "s-S-<up>") 'windmove-up)
      (exwm-input-set-key (kbd "s-S-<down>") 'windmove-down)
      (exwm-input-set-key (kbd "s-S-<left>") 'windmove-left)
      (exwm-input-set-key (kbd "s-S-<right>") 'windmove-right)

      (exwm-input-set-key (kbd "C-M-<left>") 'shrink-window-horizontally)
      (exwm-input-set-key (kbd "C-M-<right>") 'enlarge-window-horizontally)
      (exwm-input-set-key (kbd "C-M-<down>") 'shrink-window)
      (exwm-input-set-key (kbd "C-M-<up>") 'enlarge-window)

      (setq exwm-input-global-keys
            `(([?\s-r] . exwm-reset)
              ([?\s-w] . exwm-workspace-switch)
              ([?\s-n] . exwm-workspace-next)
              ([?\s-p] . exwm-workspace-previous)
              ([?\s-&] . (lambda (command)
                           (interactive (list (read-shell-command "$ ")))
                           (start-process-shell-command command nil command)))
              ,@(mapcar (lambda (i)
                          `(,(kbd (format "s-%d" i)) .
                            (lambda ()
                              (interactive)
                              (exwm-workspace-switch-create ,i))))
                        (number-sequence 0 8))))

      (add-hook 'exwm-update-class-hook
                (lambda ()
                  (unless (or (string-prefix-p "sun-awt-X11-" exwm-instance-name)
                              (string= "gimp" exwm-instance-name))
                    (exwm-workspace-rename-buffer exwm-class-name))))
      (add-hook 'exwm-update-title-hook
                (lambda ()
                  (when (or (not exwm-instance-name)
                            (string-prefix-p "sun-awt-X11-" exwm-instance-name)
                            (string= "gimp" exwm-instance-name))
                    (exwm-workspace-rename-buffer exwm-title))))


      (setq window-divider-default-right-width 1)
      (window-divider-mode))

    (ignore-errors
      (trigger_polybar))

    (use-package helm-exwm
      :ensure t
      :bind (("s-x" . helm-exwm)))
  #+END_SRC

  #+RESULTS:
  : helm-exwm

  #+begin_src emacs-lisp
    (use-package dmenu
      :ensure t
      :config
      (setq dmenu-prompt-string "dmenu: ")
      (exwm-input-set-key (kbd "s-<return>") 'dmenu))
  #+end_src

  #+RESULTS:
  : t

  #+begin_src emacs-lisp
    (use-package windmove
      :ensure t)
  #+end_src

  #+RESULTS:

  #+begin_src emacs-lisp
    (global-set-key (kbd "<s-up>")     'buf-move-up)
    (global-set-key (kbd "<s-down>")   'buf-move-down)
    (global-set-key (kbd "<s-left>")   'buf-move-left)
    (global-set-key (kbd "<s-right>")  'buf-move-right)
  #+end_src

  #+RESULTS:
  : buf-move-right

  #+begin_src emacs-lisp
    (require 'exwm-randr)
    (exwm-randr-enable)
    (require 'exwm-systemtray)
    (exwm-systemtray-enable)
  #+end_src

  #+RESULTS:
  | exwm-systemtray--exit | exwm-randr--exit |

  #+begin_src emacs-lisp
    (defun my/exwm-randr-auto-get-monitor ()
      (let* ((result)
             (monitors (nth 1 (exwm-randr--get-monitors))))
        (dotimes (i (/ (length monitors) 2))
          (push (nth (* i 2) monitors) result)
          (push i result))
        result))

    (defun monitor-home-setup ()
      (interactive)
      (kill_polybar)
      (setq exwm-randr-workspace-output-plist '(0 "eDP-1" 1 "HDMI-1"))
      ;;(shell-command "xrandr --output HDMI-1 --mode 1920x1080 --above eDP-1 --transform 1.0,0,-48,0,1.0,-20,0,0,1")
      (shell-command "xrandr --output HDMI-1 --mode 1280x720 --right-of eDP-1")
      (trigger_polybar "eDP-1"))

    (defun monitor-home-teardown ()
      (interactive)
      (kill_polybar)
      (setq exwm-randr-workspace-output-plist '(0 "eDP-1"))
      (shell-command "xrandr --output eDP-1 --auto --output HDMI-1 --off")
      (trigger_polybar "eDP-1"))
#+end_src

#+RESULTS:
: monitor-home-teardown

#+RESULTS:
: #<window 10 on *Async Shell Command*>


  I really like having a `dashboard` like home screen

  #+begin_src emacs-lisp
     (use-package dashboard
       :ensure t
       :init
       (add-hook 'after-init-hook 'dashboard-refresh-buffer)
       :config
       (setq dashboard-banner-logo-title "Welcome to Amacs!")
       (setq dashboard-image-banner-max-height 200)
       (setq dashboard-image-banner-max-width 200)
       (setq dashboard-center-content t)
       (setq dashboard-startup-banner "~/.emacs.d/resources/penrose.png")
       (dashboard-setup-startup-hook)
       )
  #+end_src

  #+RESULTS:
  : t
